{
  "List": {
    "Accuracy": "{0} times per combat, this unit may reroll an attack.",
    "Blood Prayer": "This unit may still act on the turn following their death.",
    "Bloodletting": "At the start of each of their turns, this unit loses 5 Defensive Strength and gains 5 Offensive Strength. At the start of every 3rd turn, this unit gains +1d10 Casualty Dice.",
    "Bouldershot": "Each round before attacking, this unit may choose to gain disadvantage on its attack roll to gain advantage on its casualty dice.",
    "Choke the Life Out of Them": "After the two attacks granted by the Range 2 trait have been made, this unit no longer has the Range trait.",
    "Claws on Bronze": "This unit may use its action to reduce all incoming casualties against it by half until the start of its next turn.",
    "Climbing Claws": "This unit counts as a Light Infantry unit for the purposes of determining terrain penalties in Jungle terrain.",
    "Crushing Landing": "When attacking from an amphibious landing, this unit has +15 Offensive Strength and does not take the normal penalties associated with an amphibious landing.",
    "Cut Down": "Against retreating units, this unit's casualty dice is 12d8.",
    "Deepsight": "In combat on the open ocean, this unit gains {0} Defensive Strength",
    "Dig In": "This units gains {0} Defensive Strength when Guarding another unit.",
    "Doctrine of al-Takayuf": "At the start of combat, this unit may choose to gain either the Platebreaker 10 trait or the Shieldwall 15 trait until the end of combat.",
    "Drag Them Down": "In naval combat, or while attacking across a river, this unit's casualty dice is 3d10",
    "Exploit Weakness": "This unit's casualty dice is 12d10 against units that are being guarded by other units.",
    "Fair Weather Fighters": "The first morale loss of each battle is applied twice to this unit",
    "Fifty Blades, One Wound": "If this unit's army is outnumbered by the enemy army, this unit has +15 Defensive Strength.",
    "Fleet of Foot": "This unit moves at a speed of 45 km/day",
    "Heroism": "At the start of combat, this unit gains +1 morale. If this unit's army is outnumbered by the enemy army, this unit instead gains +3 morale and grants +1 morale to 1 unit.",
    "Hill Canter": "This unit's movement speed is not reduced by Hill terrain.",
    "Hit and Run": "This unit cannot guard or be guarded by other units.",
    "Hookblades": "This unit gains {0} Offensive Strength against units that are guarding other units.",
    "Horsebane": "This unit gains {0} Offensive Strength against Light Cavalry and Heavy Cavalry units.",
    "Horsedread": "This unit gains {0} Defensive Strength against Light Cavalry and Heavy Cavalry units.",
    "Impact": "This unit gains {0} Offensive Strength against Heavy Infantry units at the start of battle, decreasing by 5 for each subsequent turn until this bonus reaches 0.",
    "Inspired": "This unit's morale bonus or penalty is doubled.",
    "Invoke Takfir": "As long as their current commander is of the same faith as this unit, its morale dice is 2d8 + 1.",
    "Iron Advance": "This unit gains +15 Offensive Strength against Light or Heavy Infantry units with the Range trait.",
    "Juggernaut": "This unit may attack while Guarding",
    "Ketiri Spite": "This unit's Morale Dice is set to 3d6 when in combat versus Tiefling units.",
    "Lance Formation": "On the first turn of combat, this unit may ignore Guarding on Heavy Infantry units, and gains +40 Defensive Strength.",
    "Lethality": "{0} times per combat, this unit may reroll its casualty dice.",
    "Living Armor": "This unit is unaffected by Steelbreaker and Platebreaker traits.",
    "Lone Wolves": "This unit gains +20 Defensive Strength when in an army of 1000 units or less.",
    "Loose Formation": "This unit can only be attacked by Ranged attacks during the last of these attacks, effectively treating all Range traits as if they were Range 1 traits.",
    "Luhim's Guidance": "On the first turn of combat, this unit does not need to roll to attack any units with less than 150 Defensive Strength, calculated after traits.",
    "Lumbering": "This unit has its Offensive Strength halved against Light Cavalry and Heavy Cavalry Units",
    "Mammoth": "At the start of combat, the enemy army must make a successful morale check or suffer -2 morale. The morale check's DC is equal to 12 + ((Amount of friendly units with Mammoth / Enemy army size) * 10 ).",
    "Mandekalu Charge": "On the first turn of combat, this unit's casualty dice is 7d10",
    "Measure Once, Cut Twice": "This unit may choose to attack twice during its turn, gaining disadvantage on both attacks.",
    "Nerves of Steel": "This unit ignores the first two morale losses of each battle.",
    "Outrun": "This unit gains {0} Defensive Strength against units that goes after it in initiative.",
    "Overwhelm": "This unit's casualty dice is 8d8 against units that go after it in initiative.",
    "Parting Gifts": "This unit may attack during retreats.",
    "Pavise Shields": "This unit gains +15 Defensive Strength after the third round of combat until the end of the battle.",
    "Pincushion": "This unit may die instead of an allied unit to casualties inflicted by attacks gained from the Range trait.",
    "Platebreaker": "This unit gains {0} Offensive Strength against Heavy Infantry units.",
    "Precision": "This unit may ignore Guarding on Heavy Infantry and Light Infantry Units when attacking.",
    "Pride Unbroken": "This unit ignores the first three morale losses of each combat, but each morale loss after that is doubled.",
    "Rally": "{0} times per combat, this unit may reroll a morale check.",
    "Range": "Before combat begins, this unit may make {0} attacks.",
    "Rashidun": "This unit doubles its morale bonus when attacking units with less morale than it.",
    "Reinforced Wheels": "This unit ignores Horsebane traits.",
    "Righteous Cause": "This unit may Guard twice its number in units. Once per combat, this unit may negate a morale loss that would be applied to its Guarded units.",
    "Rooted": "This unit has disadvantage on attacks against retreating units",
    "Run Down": "This unit gains +15 Offensive Strength against Light and Heavy Infantry units.",
    "Scholars of War": "Each Yamaist Sergeant may assign +10 Offensive or +10 Defensive Strength at the start of combat to 5 allied units. Even if the Yamaist Sergeant is slain, the bonus remains until the end of combat.. If there is no assigned commander, a Yamaist Sergeant may serve in that role as a (Int +2, Wis +2, Cha 0, Prof +3) Commander.",
    "Seagull's Sight": "This unit gains the Range 2 trait in combat on the open ocean.",
    "Seek the Heart": "Casualties inflicted by this unit are always killed or mortally wounded, and cannot be brought back to service without major magical assistance.",
    "Shieldwall": "This unit gains {0} Defensive Strength against units with the Range trait.",
    "Shock and Awe": "This unit has +20 Defensive Strength against units with lower morale than it.",
    "Slice Through": "This unit's casualty dice is 6d10 against Light Infantry Units.",
    "Smokescreens": "This unit may choose to guard twice its number on a turn, but cannot guard any units the following turn.",
    "Sokejan Feint": "At the start of combat, this unit may choose to gain either the Horsebane 10 trait or the Range 1 trait until the end of combat.",
    "Spine and Spirit": "This unit gains {0} Defensive Strength against units with more Offensive Strength than it.",
    "Spirits' Endurance": "This unit ignores any exhaustion and morale penalties on the first round of combat.",
    "Stalwart Steed": "This unit ignores Horsedread traits.",
    "Suppress": "This unit gains {0} Defensive Strength against units with less Offensive Strength than it.",
    "Three Points for Three Men": "If this unit's army is outnumbered by the enemy army, this unit has +1d10 Casualty Dice.",
    "To Shatter Mountains": "This units gains {0} Offensive Strength against units with Defensive Strength 100 or above.",
    "Trappers": "On the first turn of combat, this unit's casualty dice is 4d12, and its initiative penalty is 0.",
    "Tread Leaf": "In Forest or Woods terrain, this unit gains {0} Defensive Strength.",
    "Unsaved": "Voidbound cannot lose morale in combat, but their maximum morale is 0.",
    "Weighted Shields": "This unit gains {0} Offensive Strength against units with less Defensive Strength than it.",
    "Zealous": "When fighting religious enemies, this unit's morale dice is 3d8 + 1.",
    "Zenata": "This unit has advantage on retreat checks.",

    "In Awe of the Size": "This unit gains {0} Defensive Strength against units that it outnumbers.",
    "Mad Lads": "This unit's casualty dice are doubled for an attack that beats the highest Defensive Strength among the enemy units."
  }
}